#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
random_string.suffix: Refreshing state... [id=gh2jet]
time_static.current: Refreshing state... [id=2025-07-09T18:56:26Z]
data.azuread_client_config.this: Reading...
data.azuread_client_config.this: Read complete after 0s [id=400ebb99-99e3-4a2a-af83-b2b5edff74fa-923b12fc-f5bf-4189-b7b9-ed16d458c874-1a2d40de-767c-43db-b2ab-501861637e3d]
azurerm_resource_group.this: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-dev-openai-ewr4hp]
azurerm_user_assigned_identity.this: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-dev-openai-ewr4hp/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-openai-gh2jet]
azurerm_key_vault.this: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-dev-openai-ewr4hp/providers/Microsoft.KeyVault/vaults/kv-openai-gh2jet]
azurerm_role_assignment.uai: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-dev-openai-ewr4hp/providers/Microsoft.KeyVault/vaults/kv-openai-gh2jet/providers/Microsoft.Authorization/roleAssignments/ec1d1735-5631-eced-0621-9ce4d187bbe0]
azurerm_key_vault_key.this: Refreshing state... [id=https://kv-openai-gh2jet.vault.azure.net/keys/cmk-openai-gh2jet/d3bb3c7168dd402ea705f3daa2cd3b37]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_cognitive_account.this will be created
  + resource "azurerm_cognitive_account" "this" {
      + custom_subdomain_name              = "gh2jet"
      + endpoint                           = (known after apply)
      + id                                 = (known after apply)
      + kind                               = "OpenAI"
      + local_auth_enabled                 = false
      + location                           = "germanywestcentral"
      + name                               = "oai-openai-gh2jet"
      + outbound_network_access_restricted = true
      + primary_access_key                 = (sensitive value)
      + public_network_access_enabled      = true
      + resource_group_name                = "rg-dev-openai-ewr4hp"
      + secondary_access_key               = (sensitive value)
      + sku_name                           = "S0"

      + customer_managed_key {
          + key_vault_key_id = "https://kv-openai-gh2jet.vault.azure.net/keys/cmk-openai-gh2jet/d3bb3c7168dd402ea705f3daa2cd3b37"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-dev-openai-ewr4hp/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-openai-gh2jet",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @vMarkusK, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*